cavityFwEHD_b/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    insulatedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          280;
        startFace       17340;
    }
    electrodeHV
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       17620;
    }
    electrodeG
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       17760;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          17600;
        startFace       17860;
    }
)

// ************************************************************************* //
