cavityFwEHD_b/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nu              [0 2 -1 0 0 0 0] 2.80E-07;

rho0       	rho0 [1 -3 0 0 0 0 0] 1459;

T0           	T0 [0 0 0 1 0 0 0] 300;

epsilon        epsilon [-1 -3 4 0 0 2 0] 4.24E-11;

bpos               bpos [-1 0 2 0 0 1 0] 4.89E-08;

bneg               bneg [-1 0 2 0 0 1 0] -4.89E-08;

D               D [0 2 -1 0 0 0 0] 1.27E-09;

neq		neq [0 -3 1 0 0 1 0] 4.33E-04;

kB		kB [1 2 -2 -1 0 0 0] 1.38064852e-23;
	
electron	electron [0 0 1 0 0 1 0] 1.60217662e-19;

// ************************************************************************* //
